{"class_name": "Model", "keras_version": "2.2.4", "config": {"input_layers": [["inputLayer", 0, 0]], "name": "model_1", "output_layers": [["outputLayer", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "inputLayer", "config": {"batch_input_shape": [null, 80, 80, 4], "name": "inputLayer", "sparse": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["inputLayer", 0, 0, {}]]], "name": "firstHiddenLayer", "config": {"kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "filters": 16, "padding": "valid", "strides": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "name": "firstHiddenLayer", "kernel_size": [8, 8], "activity_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["firstHiddenLayer", 0, 0, {}]]], "name": "secondHiddenLayer", "config": {"kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "filters": 32, "padding": "valid", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "name": "secondHiddenLayer", "kernel_size": [4, 4], "activity_regularizer": null}}, {"class_name": "Flatten", "inbound_nodes": [[["secondHiddenLayer", 0, 0, {}]]], "name": "flattenLayer", "config": {"name": "flattenLayer", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["flattenLayer", 0, 0, {}]]], "name": "thirdHiddenLayer", "config": {"kernel_constraint": null, "units": 256, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "thirdHiddenLayer"}}, {"class_name": "Dense", "inbound_nodes": [[["thirdHiddenLayer", 0, 0, {}]]], "name": "outputLayer", "config": {"kernel_constraint": null, "units": 18, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "outputLayer"}}]}, "backend": "tensorflow"}