{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "inputLayer", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 80, 80, 4], "dtype": "float32", "sparse": false, "name": "inputLayer"}, "inbound_nodes": []}, {"name": "firstHiddenLayer", "class_name": "Conv2D", "config": {"name": "firstHiddenLayer", "trainable": true, "filters": 16, "kernel_size": [8, 8], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["inputLayer", 0, 0, {}]]]}, {"name": "secondHiddenLayer", "class_name": "Conv2D", "config": {"name": "secondHiddenLayer", "trainable": true, "filters": 32, "kernel_size": [4, 4], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["firstHiddenLayer", 0, 0, {}]]]}, {"name": "flattenLayer", "class_name": "Flatten", "config": {"name": "flattenLayer", "trainable": true}, "inbound_nodes": [[["secondHiddenLayer", 0, 0, {}]]]}, {"name": "thirdHiddenLayer", "class_name": "Dense", "config": {"name": "thirdHiddenLayer", "trainable": true, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flattenLayer", 0, 0, {}]]]}, {"name": "outputLayer", "class_name": "Dense", "config": {"name": "outputLayer", "trainable": true, "units": 18, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["thirdHiddenLayer", 0, 0, {}]]]}], "input_layers": [["inputLayer", 0, 0]], "output_layers": [["outputLayer", 0, 0]]}, "keras_version": "2.0.5", "backend": "theano"}